projects.org
#+TITLE: Emacs Hacking Projects
#+OPTIONS: html-style:nil
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="assets/css/style.css" />
#+INFOJS_OPT: ltoc:t toc:t view:info home:http://emacs.london/
#+EXPORT_FILE_NAME: ./projects.html

/REMINDER/ Some projects may have, some utility although that's mostly a secondary concern :)
Fun is a number one concern!

* Org Projects
** Ability to jump to an org link (e.g. footnotes) in another buffer/window
   *PROBLEM*
   When buffer is narrowed can't preview the footnotes (for reference)
   *HOW*
   - using ~clone-indirect-buffer~ functionality
** Xanadu
   *PROBLEM*
   I find myself writing more and more stuff in org.
   With that comes the need of having a way to make and show the interconnections between those writings.
   *DESCRIPTION*
   In other words I'm finding myslef in need of a more powerful reference mechanism.
   Every now and then when I'm looking for answers on-line or try to sketch some solutions myself I'm going back to Ted Nelson and Xanadu and keep thinking that I'm just would like to re-implement some of his ideas in Emacs :)
   When I've realised that and started to look around myself I found that some people already did some of that.
   Nevertheless I think that this would make for a great elisp exercise and I would love to see how far we can go.
   I believe some of the results may prove to be practical (I know I want some of that) but I want to do it mainly for the fun of it!
*** Sharing fragments
    *Sharing writing done in org mode*
    There are two main options here
    - collaboration
      - two way mechanism with syncing etc.
      - this is solved through github
    - publishing
      - this only requires one way mechanis
      - can this be solved by e.g. gists?
    There are questions pertinent to both
    - format
      - for collaboration it stays in org
      - I think export is necesserry for other ppl to consume
    - permissions
      - collaboration: full permission mechanics of GH
      - secret gists
        - can be only accessed by those with the URL
    - sharing fragments
      - for collaboration this is the difficult question
      - for sharing this just needs a subtree export
    - live/realtime update?
      - this is too hard and an overkill for now

    Workflow
    - Two stage workflow for publishing
      - this will work because is unidirectional flow
        - so there can be modifications to published versoin because they will never have to be incorporated back into the original
    - review the original note: to make sure that base changes are there
    - review the copy for publishing: this should be subtractive and slight changes to presentations not to the core. Essential changes should go into phase one
    - those changes and exports should be recorded with timestamps maybe message
      - use property drawer for this?

    Gists
    - seems to already be there
      - could use this: https://github.com/defunkt/gist.el
    - can share files and folders
    - could use markdown, so potentially ppl could edit it and it could take life of it's own

    Dropbox html sharing folder?
    - I don't think that exists anymore

    Publish to blog, straight away!
    - would be nice at some point, don't thing I have to guts to do it now

    Export to HTML and push to git repo with gh pages enabled
    - this is a bit manual, but could be automated ofc
    - would edit the note as is in the original org file
    - press keybinding to trigger publishing
    - would open a capture type window for edits to the final draft
    - after confirmed with ~C-c C-c~ would export to html in the background, stage changes, and bring up to commit window (and automatically push if not run with prefix argument)
    - would generate url and copy it to clipboard
*** References
* General Emacs Projects
** Easier way to have multiple narrow views of one file
   I sometimes want to work on multiple things at a time that are in the same buffer.
   I can always ~clone-indirect-buffer~ but that's kinda hard ;)
   - provides no semantics for manipulation/switching etc.
** Window navigation aware of system windows (kinda)
   *GOAL*
   set-up: More than one emacs frame
   ~SPC w h/l~ should be aware of existence of additional frames (system windows)
   *FIRST APPROXIMATION*
   e.g. navigating to window 'on the left' on Mac
   - if there's an emacs window
     - switch to that window
     - else: use ~s-`~ to switch to other emacs frame
   - caveats
     - makes some sense for two frames (also not quite, cause it's not aware of direction, but still usefull)
     - very little sense for more
