projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-28 Sun 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Hacking Projects</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pawel" />
<link rel="stylesheet" type="text/css" href="assets/css/style.css" />

</head>
<body>
<div id="content">
<h1 class="title">Emacs Hacking Projects</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3402286">1. Org Projects</a>
<ul>
<li><a href="#orgbe3352e">1.1. Ability to jump to an org link (e.g. footnotes) in another buffer/window</a></li>
<li><a href="#org3f28a62">1.2. Xanadu</a>
<ul>
<li><a href="#org7bf7803">1.2.1. Sharing fragments</a></li>
<li><a href="#org86cb829">1.2.2. References</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcec04eb">2. General Emacs Projects</a>
<ul>
<li><a href="#orga757bd7">2.1. Easier way to have multiple narrow views of one file</a></li>
<li><a href="#org416fdff">2.2. Window navigation aware of system windows (kinda)</a></li>
<li><a href="#orge31f26d">2.3. "Freeze view" for helm/which key</a></li>
<li><a href="#org7c55d3f">2.4. Persistent undo and jump to last change history</a></li>
<li><a href="#orgbcc2cff">2.5. Hypothes.is for emacs!</a></li>
<li><a href="#org35c4a8f">2.6. Parse git diff's for org headlines that changed</a>
<ul>
<li><a href="#org35455f6">2.6.1. Example approach</a></li>
</ul>
</li>
<li><a href="#org7f3dfb3">2.7. look and feel</a>
<ul>
<li><a href="#org033d545">2.7.1. Playing with font-locks</a></li>
<li><a href="#org24759e8">2.7.2. Explore limits of emacs display capabilities</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org94d23db">3. Spacemacs/Evil Specific Projects</a>
<ul>
<li><a href="#org2c4d588">3.1. Evil-search improvements: n/N to be consistent</a></li>
</ul>
</li>
<li><a href="#org966c922">4. Clojure Related Projects</a>
<ul>
<li><a href="#orgb41fdaa">4.1. Automatic matching against "clojure error message catalogue"</a></li>
<li><a href="#orgd0f14b3">4.2. Clojure file buffers and repl buffer interactions</a></li>
<li><a href="#org6eb73ad">4.3. Org to handle links to project namesapces</a></li>
<li><a href="#orgb196119">4.4. Emacs clojure dev plugin</a></li>
<li><a href="#orgeab28ea">4.5. Auto-save cider repl interactions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>REMINDER</i> Some projects may have, some utility although that's mostly a secondary concern :)
Fun is a number one concern!
</p>

<div id="outline-container-org3402286" class="outline-2">
<h2 id="org3402286"><span class="section-number-2">1</span> Org Projects</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbe3352e" class="outline-3">
<h3 id="orgbe3352e"><span class="section-number-3">1.1</span> Ability to jump to an org link (e.g. footnotes) in another buffer/window</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>PROBLEM</b>
When buffer is narrowed can't preview the footnotes (for reference)
<b>HOW</b>
</p>
<ul class="org-ul">
<li>using <code>clone-indirect-buffer</code> functionality</li>
</ul>
</div>
</div>
<div id="outline-container-org3f28a62" class="outline-3">
<h3 id="org3f28a62"><span class="section-number-3">1.2</span> Xanadu</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>PROBLEM</b>
I find myself writing more and more stuff in org.
With that comes the need of having a way to make and show the interconnections between those writings.
<b>DESCRIPTION</b>
In other words I'm finding myslef in need of a more powerful reference mechanism.
Every now and then when I'm looking for answers on-line or try to sketch some solutions myself I'm going back to Ted Nelson and Xanadu and keep thinking that I'm just would like to re-implement some of his ideas in Emacs :)
When I've realised that and started to look around myself I found that some people already did some of that.
Nevertheless I think that this would make for a great elisp exercise and I would love to see how far we can go.
I believe some of the results may prove to be practical (I know I want some of that) but I want to do it mainly for the fun of it!
</p>
</div>
<div id="outline-container-org7bf7803" class="outline-4">
<h4 id="org7bf7803"><span class="section-number-4">1.2.1</span> Sharing fragments</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<b>Sharing writing done in org mode</b>
There are two main options here
</p>
<ul class="org-ul">
<li>collaboration
<ul class="org-ul">
<li>two way mechanism with syncing etc.</li>
<li>this is solved through github</li>
</ul></li>
<li>publishing
<ul class="org-ul">
<li>this only requires one way mechanis</li>
<li>can this be solved by e.g. gists?</li>
</ul></li>
</ul>
<p>
There are questions pertinent to both
</p>
<ul class="org-ul">
<li>format
<ul class="org-ul">
<li>for collaboration it stays in org</li>
<li>I think export is necesserry for other ppl to consume</li>
</ul></li>
<li>permissions
<ul class="org-ul">
<li>collaboration: full permission mechanics of GH</li>
<li>secret gists
<ul class="org-ul">
<li>can be only accessed by those with the URL</li>
</ul></li>
</ul></li>
<li>sharing fragments
<ul class="org-ul">
<li>for collaboration this is the difficult question</li>
<li>for sharing this just needs a subtree export</li>
</ul></li>
<li>live/realtime update?
<ul class="org-ul">
<li>this is too hard and an overkill for now</li>
</ul></li>
</ul>

<p>
Workflow
</p>
<ul class="org-ul">
<li>Two stage workflow for publishing
<ul class="org-ul">
<li>this will work because is unidirectional flow
<ul class="org-ul">
<li>so there can be modifications to published versoin because they will never have to be incorporated back into the original</li>
</ul></li>
</ul></li>
<li>review the original note: to make sure that base changes are there</li>
<li>review the copy for publishing: this should be subtractive and slight changes to presentations not to the core. Essential changes should go into phase one</li>
<li>those changes and exports should be recorded with timestamps maybe message
<ul class="org-ul">
<li>use property drawer for this?</li>
</ul></li>
</ul>

<p>
Gists
</p>
<ul class="org-ul">
<li>seems to already be there
<ul class="org-ul">
<li>could use this: <a href="https://github.com/defunkt/gist.el">https://github.com/defunkt/gist.el</a></li>
</ul></li>
<li>can share files and folders</li>
<li>could use markdown, so potentially ppl could edit it and it could take life of it's own</li>
</ul>

<p>
Dropbox html sharing folder?
</p>
<ul class="org-ul">
<li>I don't think that exists anymore</li>
</ul>

<p>
Publish to blog, straight away!
</p>
<ul class="org-ul">
<li>would be nice at some point, don't thing I have to guts to do it now</li>
</ul>

<p>
Export to HTML and push to git repo with gh pages enabled
</p>
<ul class="org-ul">
<li>this is a bit manual, but could be automated ofc</li>
<li>would edit the note as is in the original org file</li>
<li>press keybinding to trigger publishing</li>
<li>would open a capture type window for edits to the final draft</li>
<li>after confirmed with <code>C-c C-c</code> would export to html in the background, stage changes, and bring up to commit window (and automatically push if not run with prefix argument)</li>
<li>would generate url and copy it to clipboard</li>
</ul>
</div>
</div>
<div id="outline-container-org86cb829" class="outline-4">
<h4 id="org86cb829"><span class="section-number-4">1.2.2</span> References</h4>
</div>
</div>
</div>
<div id="outline-container-orgcec04eb" class="outline-2">
<h2 id="orgcec04eb"><span class="section-number-2">2</span> General Emacs Projects</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga757bd7" class="outline-3">
<h3 id="orga757bd7"><span class="section-number-3">2.1</span> Easier way to have multiple narrow views of one file</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I sometimes want to work on multiple things at a time that are in the same buffer.
I can always <code>clone-indirect-buffer</code> but that's kinda hard ;)
</p>
<ul class="org-ul">
<li>provides no semantics for manipulation/switching etc.</li>
</ul>
</div>
</div>
<div id="outline-container-org416fdff" class="outline-3">
<h3 id="org416fdff"><span class="section-number-3">2.2</span> Window navigation aware of system windows (kinda)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>GOAL</b>
set-up: More than one emacs frame
<code>SPC w h/l</code> should be aware of existence of additional frames (system windows)
<b>FIRST APPROXIMATION</b>
e.g. navigating to window 'on the left' on Mac
</p>
<ul class="org-ul">
<li>if there's an emacs window
<ul class="org-ul">
<li>switch to that window</li>
<li>else: use <code>s-`</code> to switch to other emacs frame</li>
</ul></li>
<li>caveats
<ul class="org-ul">
<li>makes some sense for two frames (also not quite, cause it's not aware of direction, but still usefull)</li>
<li>very little sense for more</li>
</ul></li>
</ul>
</div>
</div>
