projects.org
** "Freeze view" for helm/which key
   *GOAL*
   Get output of helm/which key commands into a buffer.

   Helm:
   Say I've got an api to explore e.g. some elisp library
   would be nice to do that through helm and have full emacs editing power at the same time

   Which key:
   Example approach
   https://github.com/justbur/emacs-which-key/commit/77586e62b6d306bae07e4e3e093ba488724f4131
   #+begin_src elisp
     ;; original--inserts into buffer, swithches the window
     (defun which-key-dump-bindings (prefix buffer-name)
       "Dump bindings from PREFIX into buffer named BUFFER-NAME.
     PREFIX should be a string suitable for `kbd'."
       (interactive "sPrefix: \nB")
       (let* ((buffer (get-buffer-create buffer-name))
              (keys (which-key--get-bindings (kbd prefix))))
         (with-current-buffer buffer
           (point-max)
           (save-excursion
             (dolist (key keys)
               (insert (apply #'format "%s%s%s\n" key)))))
         (switch-to-buffer-other-window buffer)))


     ;; edited--returns values
     (defun which-key-dump-bindings (prefix buffer-name)
       "Dump bindings from PREFIX into buffer named BUFFER-NAME.
          PREFIX should be a string suitable for `kbd'."
       (interactive "sPrefix: \nB")
       (let* ((buffer (get-buffer-create buffer-name))
              (keys (which-key--get-bindings (kbd prefix))))
         (with-current-buffer buffer
           (point-max)
           (save-excursion
             (mapcar (lambda (x) (apply #'format "%s%s%s\n" x)) keys)))
         ))

     (which-key-dump-bindings "SPC f" "emacs.org")
   #+end_src

** Persistent undo and jump to last change history
   Vim has that ;P
   I'm pretty used to being able to use jump/edit history after coming back to a file after a while.
   Not even sure how vim implements that?
** Hypothes.is for emacs!
   - interface hypothes.is
     - viewing annotations tree in Emacs
   - highlights/annotations in org files
     - this would need them to be version controlled (so links work)
     - need to be public
** Parse git diff's for org headlines that changed
   Effectively an org-specific/automatic change log
*** Example approach
    - Clean git diff into org document
    - Save filename
    - Parse headlines
    - Join them into links like: =file:projects.org::*task=
      - to refer back to those changes
      - difficulty: this would have to be a (ma)git reference to when the change was introduced??
        - or just current, yeah!
    Could this be integrated somehow into a /magit/ function?
    Taking the commit under point as a starting point for calculating diff
** look and feel
*** Playing with font-locks
    *MOTIVATION*
    I've had this thing where I wanted: nice way to display inline src block
    OFC there is a way to do this...

    - Inline code src_elisp[:exports both]{clone-indirect-buffer}
    [[https://orgmode.org/manual/Structure-of-code-blocks.html][Full syntax]]:
    #+BEGIN_EXAMPLE
   An inline code block conforms to this structure:

   src_<language>{<body>}
   or

   src_<language>[<header arguments>]{<body>}
    #+END_EXAMPLE
    There seems to even be a [[https://stackoverflow.com/questions/20309842/how-to-syntax-highlight-for-org-mode-inline-source-code-src-lang/28059832#28059832][way]] to fontify that
    #+BEGIN_SRC elisp
   (font-lock-add-keywords 'org-mode
                    '(("\\(src_\\)\\([^[{]+\\)\\(\\[:.*\\]\\){\\([^}]*\\)}"
                       (1 '(:foreground "black" :weight 'normal :height 5)) ; src_ part
                       (2 '(:foreground "cyan" :weight 'bold :height 75 :underline "red")) ; "lang" part.
                       (3 '(:foreground "#555555" :height 5)) ; [:header arguments] part.
                       (4 'org-code) ; "code..." part.
                       )))
    #+END_SRC
    Example challenge: regex/matcher used here could to modify to allow for the brackets to be optional
    Diving into that would be quite cool
    Experimenting with some wild font-locks ;P
*** Explore limits of emacs display capabilities
    How to design more modern, clean interfaces in emacs
    E.g. solarized theme uses variable width font for org headlines
    Customize is a pretty interesting form like interface
    I've seen some ppl with cool doom emacs configs
    I think *path for exploration* would be to try to copy interfaces in other medium
    - try to make something that looks like web form
    - try to make a more 'native' look
    - distraction free emacs
    - emacs for writers
* Spacemacs/Evil Specific Projects
** Evil-search improvements: n/N to be consistent
   ~n~ always go down in search
   ~N~ always go up in search
* Clojure Related Projects
