projects.html
<div id="outline-container-orge31f26d" class="outline-3">
<h3 id="orge31f26d"><span class="section-number-3">2.3</span> "Freeze view" for helm/which key</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<b>GOAL</b>
Get output of helm/which key commands into a buffer.
</p>

<p>
Helm:
Say I've got an api to explore e.g. some elisp library
would be nice to do that through helm and have full emacs editing power at the same time
</p>

<p>
Which key:
Example approach
<a href="https://github.com/justbur/emacs-which-key/commit/77586e62b6d306bae07e4e3e093ba488724f4131">https://github.com/justbur/emacs-which-key/commit/77586e62b6d306bae07e4e3e093ba488724f4131</a>
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">original--inserts into buffer, swithches the window</span>
(<span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">which-key-dump-bindings</span> (prefix buffer-name)
  <span style="color: #da8b55;">"Dump bindings from PREFIX into buffer named BUFFER-NAME.</span>
<span style="color: #da8b55;">PREFIX should be a string suitable for `</span><span style="color: #4e3163;">kbd</span><span style="color: #da8b55;">'."</span>
  (<span style="color: #3a81c3; font-weight: bold;">interactive</span> <span style="color: #2d9574;">"sPrefix: \nB"</span>)
  (<span style="color: #3a81c3; font-weight: bold;">let*</span> ((buffer (get-buffer-create buffer-name))
         (keys (which-key--get-bindings (kbd prefix))))
    (<span style="color: #3a81c3; font-weight: bold;">with-current-buffer</span> buffer
      (point-max)
      (<span style="color: #3a81c3; font-weight: bold;">save-excursion</span>
        (<span style="color: #3a81c3; font-weight: bold;">dolist</span> (key keys)
          (insert (apply #'format <span style="color: #2d9574;">"%s%s%s\n"</span> key)))))
    (switch-to-buffer-other-window buffer)))


<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">edited--returns values</span>
(<span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">which-key-dump-bindings</span> (prefix buffer-name)
  <span style="color: #da8b55;">"Dump bindings from PREFIX into buffer named BUFFER-NAME.</span>
<span style="color: #da8b55;">     PREFIX should be a string suitable for `</span><span style="color: #4e3163;">kbd</span><span style="color: #da8b55;">'."</span>
  (<span style="color: #3a81c3; font-weight: bold;">interactive</span> <span style="color: #2d9574;">"sPrefix: \nB"</span>)
  (<span style="color: #3a81c3; font-weight: bold;">let*</span> ((buffer (get-buffer-create buffer-name))
         (keys (which-key--get-bindings (kbd prefix))))
    (<span style="color: #3a81c3; font-weight: bold;">with-current-buffer</span> buffer
      (point-max)
      (<span style="color: #3a81c3; font-weight: bold;">save-excursion</span>
        (mapcar (<span style="color: #3a81c3; font-weight: bold;">lambda</span> (x) (apply #'format <span style="color: #2d9574;">"%s%s%s\n"</span> x)) keys)))
    ))

(which-key-dump-bindings <span style="color: #2d9574;">"SPC f"</span> <span style="color: #2d9574;">"emacs.org"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c55d3f" class="outline-3">
<h3 id="org7c55d3f"><span class="section-number-3">2.4</span> Persistent undo and jump to last change history</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Vim has that ;P
I'm pretty used to being able to use jump/edit history after coming back to a file after a while.
Not even sure how vim implements that?
</p>
</div>
</div>
<div id="outline-container-orgbcc2cff" class="outline-3">
<h3 id="orgbcc2cff"><span class="section-number-3">2.5</span> Hypothes.is for emacs!</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>interface hypothes.is
<ul class="org-ul">
<li>viewing annotations tree in Emacs</li>
</ul></li>
<li>highlights/annotations in org files
<ul class="org-ul">
<li>this would need them to be version controlled (so links work)</li>
<li>need to be public</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org35c4a8f" class="outline-3">
<h3 id="org35c4a8f"><span class="section-number-3">2.6</span> Parse git diff's for org headlines that changed</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Effectively an org-specific/automatic change log
</p>
</div>
<div id="outline-container-org35455f6" class="outline-4">
<h4 id="org35455f6"><span class="section-number-4">2.6.1</span> Example approach</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>Clean git diff into org document</li>
<li>Save filename</li>
<li>Parse headlines</li>
<li>Join them into links like: <code>file:projects.org::*task</code>
<ul class="org-ul">
<li>to refer back to those changes</li>
<li>difficulty: this would have to be a (ma)git reference to when the change was introduced??
<ul class="org-ul">
<li>or just current, yeah!</li>
</ul></li>
</ul></li>
</ul>
<p>
Could this be integrated somehow into a <i>magit</i> function?
Taking the commit under point as a starting point for calculating diff
</p>
</div>
</div>
</div>
<div id="outline-container-org7f3dfb3" class="outline-3">
<h3 id="org7f3dfb3"><span class="section-number-3">2.7</span> look and feel</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org033d545" class="outline-4">
<h4 id="org033d545"><span class="section-number-4">2.7.1</span> Playing with font-locks</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
<b>MOTIVATION</b>
I've had this thing where I wanted: nice way to display inline src block
OFC there is a way to do this&#x2026;
</p>

<ul class="org-ul">
<li>Inline code <code class="src src-elisp">clone-indirect-buffer</code></li>
</ul>
<p>
<a href="https://orgmode.org/manual/Structure-of-code-blocks.html">Full syntax</a>:
</p>
<pre class="example">
An inline code block conforms to this structure:

src_&lt;language&gt;{&lt;body&gt;}
or

src_&lt;language&gt;[&lt;header arguments&gt;]{&lt;body&gt;}
</pre>
<p>
There seems to even be a <a href="https://stackoverflow.com/questions/20309842/how-to-syntax-highlight-for-org-mode-inline-source-code-src-lang/28059832#28059832">way</a> to fontify that
</p>
<div class="org-src-container">
<pre class="src src-elisp">(font-lock-add-keywords 'org-mode
                 '((<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">src_</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">[</span><span style="color: #4e3163;">^</span><span style="color: #2d9574;">[{]+</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">\\[</span><span style="color: #4e3163;">:.*\\</span><span style="color: #2d9574;">]</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574;">{</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">[</span><span style="color: #4e3163;">^</span><span style="color: #2d9574;">}]*</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574;">}"</span>
                    (<span style="color: #4e3163;">1</span> '(<span style="color: #3a81c3;">:foreground</span> <span style="color: #2d9574;">"black"</span> <span style="color: #3a81c3;">:weight</span> 'normal <span style="color: #3a81c3;">:height</span> <span style="color: #4e3163;">5</span>)) <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">src_ part</span>
                    (<span style="color: #4e3163;">2</span> '(<span style="color: #3a81c3;">:foreground</span> <span style="color: #2d9574;">"cyan"</span> <span style="color: #3a81c3;">:weight</span> 'bold <span style="color: #3a81c3;">:height</span> <span style="color: #4e3163;">75</span> <span style="color: #3a81c3;">:underline</span> <span style="color: #2d9574;">"red"</span>)) <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"lang" part.</span>
                    (<span style="color: #4e3163;">3</span> '(<span style="color: #3a81c3;">:foreground</span> <span style="color: #2d9574;">"#555555"</span> <span style="color: #3a81c3;">:height</span> <span style="color: #4e3163;">5</span>)) <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[:header arguments] part.</span>
                    (<span style="color: #4e3163;">4</span> 'org-code) <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"code..." part.</span>
                    )))
</pre>
</div>
<p>
Example challenge: regex/matcher used here could to modify to allow for the brackets to be optional
Diving into that would be quite cool
Experimenting with some wild font-locks ;P
</p>
</div>
</div>
<div id="outline-container-org24759e8" class="outline-4">
<h4 id="org24759e8"><span class="section-number-4">2.7.2</span> Explore limits of emacs display capabilities</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
How to design more modern, clean interfaces in emacs
E.g. solarized theme uses variable width font for org headlines
Customize is a pretty interesting form like interface
I've seen some ppl with cool doom emacs configs
I think <b>path for exploration</b> would be to try to copy interfaces in other medium
</p>
<ul class="org-ul">
<li>try to make something that looks like web form</li>
<li>try to make a more 'native' look</li>
<li>distraction free emacs</li>
<li>emacs for writers</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org94d23db" class="outline-2">
<h2 id="org94d23db"><span class="section-number-2">3</span> Spacemacs/Evil Specific Projects</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2c4d588" class="outline-3">
<h3 id="org2c4d588"><span class="section-number-3">3.1</span> Evil-search improvements: n/N to be consistent</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>n</code> always go down in search
<code>N</code> always go up in search
</p>
</div>
</div>
</div>
<div id="outline-container-org966c922" class="outline-2">
<h2 id="org966c922"><span class="section-number-2">4</span> Clojure Related Projects</h2>
<div class="outline-text-2" id="text-4">
</div>
