projects.org
** Automatic matching against "clojure error message catalogue"
   https://github.com/yogthos/clojure-error-message-catalog/tree/master/clj
** Clojure file buffers and repl buffer interactions
   Better interaction between REPL buffer and source file buffers
** Org to handle links to project namesapces
   eg. ~com.foobar.books~
   Custom link type? Is there a way to delegate this to clojure-mode jump handler?
** Emacs clojure dev plugin
   have a state like the lisp state
   then single letter commmands from most commpon operations
   #+begin_src clojure
     some-stuff ; 1
     (first some-stuff) ; m
     (map | (first some-stuff)) ; t
     (take | ((map :some-key (first some-stuff)))) ; f
     (filter | ...) ; m
     (map | ...) ; c



     first : 1
     map : m
     reduce : r
     filter : f
     and : a
     or : o
     take : t
     count : c
     etc.
   #+end_src
** Auto-save cider repl interactions
   This would be pretty useful
   ~cider-repl-history-save~
   The format is then elisp, would be nice to just get text file with clojure forms
   - human readable
   - reusable

'(("en" "<p class=\"author\">Author: %a (%e)</p>
<p class=\"date\">Date: %d</p>
<p class=\"creator\">%c</p>
<p class=\"validation\">%v</p>"))

* Local vars :noexport:
