projects.html
<div id="outline-container-orgb41fdaa" class="outline-3">
<h3 id="orgb41fdaa"><span class="section-number-3">4.1</span> Automatic matching against "clojure error message catalogue"</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://github.com/yogthos/clojure-error-message-catalog/tree/master/clj">https://github.com/yogthos/clojure-error-message-catalog/tree/master/clj</a>
</p>
</div>
</div>
<div id="outline-container-orgd0f14b3" class="outline-3">
<h3 id="orgd0f14b3"><span class="section-number-3">4.2</span> Clojure file buffers and repl buffer interactions</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Better interaction between REPL buffer and source file buffers
</p>
</div>
</div>
<div id="outline-container-org6eb73ad" class="outline-3">
<h3 id="org6eb73ad"><span class="section-number-3">4.3</span> Org to handle links to project namesapces</h3>
<div class="outline-text-3" id="text-4-3">
<p>
eg. <code>com.foobar.books</code>
Custom link type? Is there a way to delegate this to clojure-mode jump handler?
</p>
</div>
</div>
<div id="outline-container-orgb196119" class="outline-3">
<h3 id="orgb196119"><span class="section-number-3">4.4</span> Emacs clojure dev plugin</h3>
<div class="outline-text-3" id="text-4-4">
<p>
have a state like the lisp state
then single letter commmands from most commpon operations
</p>
<div class="org-src-container">
<pre class="src src-clojure">some-stuff <span style="color: #2aa1ae; background-color: #ecf3ec;">; 1</span>
<span style="color: #a094a2;">(</span>first some-stuff<span style="color: #a094a2;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; m</span>
<span style="color: #a094a2;">(</span>map | <span style="color: #a094a2;">(</span>first some-stuff<span style="color: #a094a2;">))</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; t</span>
<span style="color: #a094a2;">(</span>take | <span style="color: #a094a2;">((</span>map <span style="color: #4e3163;">:some-key</span> <span style="color: #a094a2;">(</span>first some-stuff<span style="color: #a094a2;">))))</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; f</span>
<span style="color: #a094a2;">(</span>filter | ...<span style="color: #a094a2;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; m</span>
<span style="color: #a094a2;">(</span>map | ...<span style="color: #a094a2;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; c</span>



first : <span style="color: #4e3163;">1</span>
map : m
reduce : r
filter : f
and : a
or : o
take : t
count : c
etc.
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeab28ea" class="outline-3">
<h3 id="orgeab28ea"><span class="section-number-3">4.5</span> Auto-save cider repl interactions</h3>
<div class="outline-text-3" id="text-4-5">
<p>
This would be pretty useful
<code>cider-repl-history-save</code>
The format is then elisp, would be nice to just get text file with clojure forms
</p>
<ul class="org-ul">
<li>human readable</li>
<li>reusable</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pawel</p>
<p class="date">Created: 2019-07-28 Sun 16:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
